src/main/resources/soap_request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:gs="http://local/gs-producing-web-service">
    <soapenv:Header/>
    <soapenv:Body>
        <gs:getCountryRequest>
            <gs:name>The Netherlands</gs:name>
        </gs:getCountryRequest>
    </soapenv:Body>
</soapenv:Envelope>